benchbnb/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "RickyBobby"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: params[:user][:username], password: params[:user][:password])

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "1EwfgqWOV_souekM6Fe1gg"], ["updated_at", "2018-12-07 23:29:12.981153"], ["id", 5]]
---
  def reset_session_token
    self.session_token = User.generate_session_token
    self.save!